Revit 2026 API

# InsulationTypeSetContains Method

---

Tests for the existence of a insulation type within the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Contains(
	InsulationType item
)
```
```vb
Public Overridable Function Contains (
	item As InsulationType
) As Boolean
```
```cpp
public:
virtual bool Contains(
	InsulationType^ item
)
```
```fsharp
abstract Contains :
        item : InsulationType -> bool
override Contains :
        item : InsulationType -> bool
```

#### Parameters

item InsulationType
    The insulation type to be searched for.

#### Return Value

BooleanThe Contains method returns True if the insulation type is within the set, otherwise False.

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace